data/outputs/rust/test4.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.134 (be patient)


Server Software:        
Server Hostname:        192.168.1.134
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.177 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      497000 bytes
HTML transferred:       223000 bytes
Requests per second:    314.75 [#/sec] (mean)
Time per request:       158.856 [ms] (mean)
Time per request:       3.177 [ms] (mean, across all concurrent requests)
Transfer rate:          152.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.9      0      47
Processing:     0  152  30.5    151     272
Waiting:        0   84  46.7     81     242
Total:          0  155  30.7    155     272

Percentage of the requests served within a certain time (ms)
  50%    155
  66%    158
  75%    164
  80%    172
  90%    187
  95%    204
  98%    241
  99%    244
 100%    272 (longest request)