data/outputs/rust/test6.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.134 (be patient)


Server Software:        
Server Hostname:        192.168.1.134
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.208 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      497000 bytes
HTML transferred:       223000 bytes
Requests per second:    311.71 [#/sec] (mean)
Time per request:       160.406 [ms] (mean)
Time per request:       3.208 [ms] (mean, across all concurrent requests)
Transfer rate:          151.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.6      0      34
Processing:     0  153  29.1    149     241
Waiting:        0   78  47.2     78     192
Total:          0  156  29.3    153     244

Percentage of the requests served within a certain time (ms)
  50%    153
  66%    169
  75%    176
  80%    178
  90%    190
  95%    194
  98%    207
  99%    235
 100%    244 (longest request)