data/outputs/rust/test7.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.134 (be patient)


Server Software:        
Server Hostname:        192.168.1.134
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.122 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      497000 bytes
HTML transferred:       223000 bytes
Requests per second:    320.28 [#/sec] (mean)
Time per request:       156.113 [ms] (mean)
Time per request:       3.122 [ms] (mean, across all concurrent requests)
Transfer rate:          155.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.7      0      31
Processing:     0  148  27.8    148     210
Waiting:        0   84  45.7     80     205
Total:          0  151  28.0    152     212

Percentage of the requests served within a certain time (ms)
  50%    152
  66%    157
  75%    162
  80%    166
  90%    186
  95%    190
  98%    203
  99%    205
 100%    212 (longest request)