data/outputs/rust/test9.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.134 (be patient)


Server Software:        
Server Hostname:        192.168.1.134
Server Port:            8080

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.274 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      497000 bytes
HTML transferred:       223000 bytes
Requests per second:    305.48 [#/sec] (mean)
Time per request:       163.679 [ms] (mean)
Time per request:       3.274 [ms] (mean, across all concurrent requests)
Transfer rate:          148.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.8      0      31
Processing:     0  157  27.6    156     224
Waiting:        0   86  48.4     80     219
Total:          0  160  27.6    158     235

Percentage of the requests served within a certain time (ms)
  50%    158
  66%    167
  75%    172
  80%    177
  90%    194
  95%    204
  98%    218
  99%    219
 100%    235 (longest request)